{
    "global": {
        "stripe": {
            "cardNumber": "Credit Card Number",
            "expMonth": "Exp Month",
            "expYear": "Exp Year",
            "cvc": "CVC",
            "pay": "Pay 9.95€",
            "cardNumberRequired": "A credit card number is required.",
            "cardNumberMustBeNumber": "The credit card number must be an integer.",
            "cardNumberMustBeValid": "The credit card number is not valid. Please, use one of the numbers we provide.",
            "expirationMonthRequired": "An expiration month is required.",
            "expirationMonthMustBeNumber": "The expiration month must be an integer between 1 and 12.",
            "expirationYearRequired": "An expiration year is required.",
            "expirationYearMustBeNumber": "The expiration year must be an integer.",
            "expirationDateIsPast": "The credit card has expired.",
            "cvcRequired": "A cvc is required.",
            "cvcMustBeNumber": "The cvc must be an integer.",
            "cvcNotInRange": "The cvc must be an integer between 100 and 999.",
            "providedNumbers": "Valid credit card numbers for payment. Please, use them."
        },
        "gdpr": {
            "1": "Privacy Policy for Null Pointer Software",
            "2": "At Musicroad, accessible from musicroad.app, one of our main priorities is the privacy of our visitors. This Privacy Policy document contains types of information that is collected and recorded by Musicroad and how we use it.",
            "3": "If you have additional questions or require more information about our Privacy Policy, do not hesitate to contact us through email at info@musicroad.app",
            "4": "General Data Protection Regulation (GDPR)",
            "5": "We are a Data Controller of your information.",
            "6": "Null Pointer Software legal basis for collecting and using the personal information described in this Privacy Policy depends on the Personal Information we collect and the specific context in which we collect the information:",
            "7": "Null Pointer Software needs to perform a contract with you",
            "8": "You have given Null Pointer Software permission to do so",
            "9": "Processing your personal information is in Null Pointer Software legitimate interests",
            "10": "Null Pointer Software needs to comply with the law",
            "11": "Null Pointer Software will retain your personal information only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use your information to the extent necessary to comply with our legal obligations, resolve disputes, and enforce our policies.",
            "12": "If you are a resident of the European Economic Area (EEA), you have certain data protection rights. If you wish to be informed what Personal Information we hold about you and if you want it to be removed from our systems, please contact us.",
            "13": "In certain circumstances, you have the following data protection rights:",
            "14": "The right to access, update or to delete the information we have on you.",
            "15": "The right of rectification.",
            "16": "The right to object.",
            "17": "The right of restriction.",
            "18": "The right to data portability.",
            "19": "The right to withdraw consent.",
            "20": "To exercise your rights, do not hesitate to contact us through email at info@musicroad.app",
            "21": "Log Files",
            "22": "Musicroad follows a standard procedure of using log files. These files log visitors when they visit websites. All hosting companies do this and a part of hosting services' analytics. The information collected by log files include internet protocol (IP) addresses, browser type, Internet Service Provider (ISP), date and time stamp, referring/exit pages, and possibly the number of clicks. These are not linked to any information that is personally identifiable. The purpose of the information is for analyzing trends, administering the site, tracking users' movement on the website, and gathering demographic information.",
            "23": "Cookies and Web Beacons",
            "24": "Like any other website, Musicroad uses 'cookies'. These cookies are used to store information including visitors' preferences, and the pages on the website that the visitor accessed or visited. The information is used to optimize the users' experience by customizing our web page content based on visitors' browser type and/or other information.",
            "25": "Privacy Policies",
            "26": "You may consult this list to find the Privacy Policy for each of the advertising partners of Musicroad.",
            "27": "Third-party ad servers or ad networks uses technologies like cookies, JavaScript, or Web Beacons that are used in their respective advertisements and links that appear on Musicroad, which are sent directly to users' browser. They automatically receive your IP address when this occurs. These technologies are used to measure the effectiveness of their advertising campaigns and/or to personalize the advertising content that you see on websites that you visit.",
            "28": "Note that Musicroad has no access to or control over these cookies that are used by third-party advertisers.",
            "29": "Third Pary Privacy Policies",
            "30": "Musicroad's Privacy Policy does not apply to other advertisers or websites. Thus, we are advising you to consult the respective Privacy Policies of these third-party ad servers for more detailed information. It may include their practices and instructions about how to opt-out of certain options. You may find a complete list of these Privacy Policies and their links here: Privacy Policy Links.",
            "31": "You can choose to disable cookies through your individual browser options. To know more detailed information about cookie management with specific web browsers, it can be found at the browsers' respective websites. What Are Cookies?",
            "32": "Children's Information",
            "33": "Another part of our priority is adding protection for children while using the internet. We encourage parents and guardians to observe, participate in, and/or monitor and guide their online activity.",
            "34": "Musicroad does not knowingly collect any Personal Identifiable Information from children under the age of 13. If you think that your child provided this kind of information on our website, we strongly encourage you to contact us immediately and we will do our best efforts to promptly remove such information from our records.",
            "35": "Online Privacy Policy Only",
            "36": "Our Privacy Policy applies only to our online activities and is valid for visitors to our website with regards to the information that they shared and/or collect in Musicroad. This policy is not applicable to any information collected offline or via channels other than this website.",
            "37": "Consent",
            "38": "By using our website, you hereby consent to our Privacy Policy and agree to its terms."
        },
        "david": "Team leader & DevOps Engineer.",
        "josemary": "Data Architect &  UI / UX designer.",
        "pablo": "Web-Server Technologies Manager.",
        "felipe": "Security Expert.",
        "antolin": "Spokesman & System administrator.",
        "alfonso": "Applitation Developer.",
        "julian": "Quality Assurance Specialist.",
        "jesus": "Network Manager.",
        "javier": "StartUs representative & Test Engineer.",
        "juan": "Fron-end operations & Marketing.",
        "frankie": "Data Base Manager.",
        "title": "Musicroad",
        "browsehappy": "You are using an <strong>outdated</strong> browser. Please <a href=\"http://browsehappy.com/?locale=en\">upgrade your browser</a> to improve your experience.",
        "exercise": "If you want to delete your account or extract the data, please contact us through email at info@musicroad.app",
        "menu": {
            "search": "Searcher",
            "home": "Home",
            "jhipster-needle-menu-add-element": "JHipster will add additional menu entries here (do not translate!)",
            "entities": {
                "main": "Entities",
                "city": "City",
                "group": "Group",
                "band": "Band",
                "collaboration": "Collaboration",
                "jhipster-needle-menu-add-entry": "JHipster will add additional entities here (do not translate!)"
            },
            "account": {
                "main": "Account",
                "settings": "Settings",
                "password": "Password",
                "sessions": "Sessions",
                "login": "Sign in",
                "logout": "Sign out",
                "editBand": "Edit my band",
                "register": "Register",
                "register2": "Let´s get started! Sign in!",
                "payment": "Payment",
                "suscribe": "Suscribe!",
                "paymentSuccess": "Payment was a success",
                "paymentError": "Payment was a failure"
            },
            "admin": {
                "main": "Administration",
                "userManagement": "User management",
                "tracker": "User tracker",
                "metrics": "Metrics",
                "health": "Health",
                "configuration": "Configuration",
                "logs": "Logs",
                "audits": "Audits",
                "apidocs": "API",
                "database": "Database",
                "jhipster-needle-menu-add-admin-element": "JHipster will add additional menu entries here (do not translate!)"
            },
            "language": "Language"
        },
        "form": {
            "username": "Username",
            "username.placeholder": "Your username",
            "currentpassword": "Current password",
            "currentpassword.placeholder": "Current password",
            "newpassword": "New password",
            "newpassword.placeholder": "New password",
            "confirmpassword": "New password confirmation",
            "confirmpassword.placeholder": "Confirm the new password",
            "email": "Email",
            "email.placeholder": "Your email",
            "terms": "I have read I accept the terms and conditions specefied in GDPR page",
            "bandName.placeholder": "Your band name",
            "componentNumber.placeholder": "Your component number",
            "creationYear.placeholder": "Your creation year",
            "bio.placeholder": "Write your biography..."
        },
        "messages": {
            "info": {
                "authenticated": {
                    "prefix": "If you want to ",
                    "link": "sign in",
                    "suffix": ", you can try the default accounts."
                },
                "register": {
                    "noaccount": "You don't have an account yet?",
                    "link": "Register a new account"
                }
            },
            "error": {
                "dontmatch": "The password and its confirmation do not match!",
                "bandName": "The band name can't be blank.",
                "year": "The creation year must be prior to the current one.",
                "picture": "The cover picture is empty or not is a correct image format.",
                "terms": "To continue, you must accept the terms and conditions.",
                "CNumber": "The component number must be more or equals than 1."
            },
            "validate": {
                "newpassword": {
                    "required": "Your password is required.",
                    "minlength": "Your password is required to be at least 4 characters.",
                    "maxlength": "Your password cannot be longer than 50 characters.",
                    "strength": "Password strength:"
                },
                "confirmpassword": {
                    "required": "Your confirmation password is required.",
                    "minlength": "Your confirmation password is required to be at least 4 characters.",
                    "maxlength": "Your confirmation password cannot be longer than 50 characters."
                },
                "email": {
                    "required": "Your email is required.",
                    "invalid": "Your email is invalid.",
                    "minlength": "Your email is required to be at least 5 characters.",
                    "maxlength": "Your email cannot be longer than 50 characters."
                }
            }
        },
        "field": {
            "id": "ID"
        },
        "ribbon": {
            "dev": "Development"
        },
        "item-count": "Showing {{first}} - {{second}} of {{total}} items."
    },
    "entity": {
        "action": {
            "addblob": "Add blob",
            "addimage": "Add image",
            "back": "Back",
            "cancel": "Cancel",
            "delete": "Delete",
            "edit": "Edit",
            "open": "Open",
            "save": "Save",
            "view": "View",
            "collaboration": "Collaboration",
            "addCollaboration": "Add collaboration"
        },
        "detail": {
            "field": "Field",
            "value": "Value"
        },
        "delete": {
            "title": "Confirm delete operation"
        },
        "validation": {
            "required": "This field is required.",
            "minlength": "This field is required to be at least {{ min }} characters.",
            "maxlength": "This field cannot be longer than {{ max }} characters.",
            "min": "This field should be at least {{ min }}.",
            "max": "This field cannot be more than {{ max }}.",
            "minbytes": "This field should be at least {{ min }} bytes.",
            "maxbytes": "This field cannot be more than {{ max }} bytes.",
            "pattern": "This field should follow pattern for {{ pattern }}.",
            "number": "This field should be a number.",
            "datetimelocal": "This field should be a date and time.",
            "patternLogin": "This field can only contain letters, digits and e-mail addresses."
        }
    },
    "error": {
        "internalServerError": "Internal server error",
        "server.not.reachable": "Server not reachable",
        "url.not.found": "Not found",
        "NotNull": "Field {{ fieldName }} cannot be empty!",
        "Size": "Field {{ fieldName }} does not meet min/max size requirements!",
        "userexists": "Login name already used!",
        "emailexists": "Email is already in use!",
        "idexists": "A new {{ entityName }} cannot already have an ID",
        "idnull": "Invalid ID"
    },
    "footer": "This is your footer"
}
